In [61]:
from mysql_db import mysql_conn
mysql_conn = mysql_conn.mysql_connection()
conn = mysql_conn.mysql

In [62]:
# show databases
conn.execute('SHOW DATABASES')

for db_name in conn:
    print(db_name[0].decode())

information_schema
my_db
mydb
mysql
performance_schema
sys

In [2]:
def create_db(db_name : str ='mydb'):
    conn.execute('SHOW DATABASES')
    db_created = False
    for table_name in conn:
        if table_name[0].decode() == db_name:
            db_created = True

    print(f'Is DB - {db_name} already Created: {db_created}')
    if not db_created:
        conn.execute(f'CREATE DATABASE {db_name}')
        print(f'Database {db_name} is created.')

create_db(db_name= 'my_db')

In [64]:
conn.execute('Use mydb')

In [3]:
def drop_tables(table_name: list = None, db_name: str = None, conn: str = None):
    delete_table_list = [table_name] if type(table_name) == 'str' else table_name
    if conn == None:
        conn = mysql_conn.mysql
    if db_name is not None:
        conn.execute(f'USE {db_name}')
    
    conn.execute('SHOW Tables')
    for table_name in conn:
        table_name_str = table_name[0].decode()
        if table_name_str  in delete_table_list:
            conn.execute(f'Drop Table {table_name_str}')
            print(f'delete {table_name[0].decode()} table')
            continue
        print(f'{table_name_str} still persist')

In [87]:
drop_tables(table_name = 'student', db_name = 'mydb')
conn.execute('CREATE TABLE student (student_id INT, name VARCHAR(20), major VARCHAR(20), PRIMARY KEY(student_id));')

delete student table

In [24]:
conn.execute('Show tables')
for table_name in conn:
    print(table_name)

(bytearray(b'student'),)

In [42]:
conn.execute('DESCRIBE student')
for i in conn:
    print(i)

('student_id', b'int', 'NO', bytearray(b'PRI'), None, '')
('name', b'varchar(20)', 'YES', bytearray(b''), None, '')
('major', b'varchar(20)', 'YES', bytearray(b''), None, '')

In [41]:
conn.execute('ALTER TABLE student ADD gpa DECIMAL(3, 2);')
conn.execute('ALTER TABLE student DROP gpa;')

In [88]:
conn.execute('Insert INTO student VALUES(1, "Jack", "Biology");')

In [4]:
def show_table_results(query: str = None):
    if query == None:
        raise Exception('query cannot be None')
    
    conn.execute(query)
    for row1 in conn:
        print(row1)

In [76]:
show_table_results('Select * From student;')

(1, 'Jack', 'Bio')
(2, 'Kate', 'Sociology')
(3, 'Claire', 'Chemistry')
(4, 'Jack', 'Bio')
(5, 'Mike', 'Computer Science')

In [89]:
conn.execute('Insert INTO student VALUES(2, "Kate", "Sociology");')
# conn.execute('Insert INTO student(student_id, name) VALUES(3, "Claire");')
conn.execute('Insert INTO student VALUES(3, "Claire", "Chemistry");')
conn.execute('Insert INTO student VALUES(4, "Jack", "Biology");')
conn.execute('Insert INTO student VALUES(5, "Mike", "Computer Science");')

In [70]:
conn.execute('DROP TABLE student;")")")")')

In [66]:
conn.execute('CREATE TABLE student (student_id INT, name VARCHAR(20) NOT NULL, major VARCHAR(20) UNIQUE, PRIMARY KEY(student_id))')

In [83]:
conn.execute('UPDATE student SET major="Bio" WHERE major = "Biology";')
conn.execute('UPDATE student SET major="Comp Sci" WHERE major = "Computer Science";')
conn.execute('UPDATE student SET major="Comp Sci" WHERE student_id = 4;')
conn.execute('UPDATE student SET major="BioChemistry" WHERE major = "Bio" OR major = "Chemistry";')

# If remove where condition then the changes will be affected to every single row.

In [85]:
conn.execute('DELETE FROM student where student_id = 5')

In [ ]:
show_table_results('Select * From student;')

In [102]:
show_table_results('Select student.name, student.major From student ORDER BY student_id DESC;')
print('============')
show_table_results('Select * From student ORDER BY major, student_id ASC;')
print('============')
show_table_results('Select * From student ORDER BY major, student_id ASC limit 2;')
print('============')
show_table_results('Select * From student Where name IN ("Claire", "Kate", "Mike");')

('Mike', 'Computer Science')
('Jack', 'Biology')
('Claire', 'Chemistry')
('Kate', 'Sociology')
('Jack', 'Biology')
============
(1, 'Jack', 'Biology')
(4, 'Jack', 'Biology')
(3, 'Claire', 'Chemistry')
(5, 'Mike', 'Computer Science')
(2, 'Kate', 'Sociology')
============
(1, 'Jack', 'Biology')
(4, 'Jack', 'Biology')
============
(2, 'Kate', 'Sociology')
(3, 'Claire', 'Chemistry')
(5, 'Mike', 'Computer Science')

In [6]:
from mysql_db import mysql_conn
mysql_conn = mysql_conn.mysql_connection()
conn = mysql_conn.mysql

Is DB - Company_Database already Created: False
Database Company_Database is created.

In [19]:
conn.execute('DROP DATABASE Company_Database;')

In [20]:
create_db(db_name ='Company_Database')

Is DB - Company_Database already Created: False
Database Company_Database is created.

In [21]:
conn.execute('USE Company_Database;')

In [22]:
conn.execute('CREATE TABLE employee (emp_id INT PRIMARY KEY, first_name VARCHAR(40), last_name VARCHAR(40), birth_day DATE, sex VARCHAR(1), salary INT, super_id INT, branch_id INT);')

In [23]:
conn.execute('CREATE TABLE branch (branch_id INT PRIMARY KEY, branch_name VARCHAR(40), mgr_id INT,mgr_start_date DATE, FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL);')

In [24]:
conn.execute('ALTER TABLE employee ADD FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL;')
conn.execute('ALTER TABLE employee ADD FOREIGN KEY(super_id) REFERENCES employee(emp_id) ON DELETE SET NULL;')

In [25]:
conn.execute('CREATE TABLE client (client_id INT PRIMARY KEY, client_name VARCHAR(40), branch_id INT, FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL);')

In [26]:
conn.execute('CREATE TABLE works_with ( emp_id INT, client_id INT, total_sales INT, PRIMARY KEY(emp_id, client_id), FOREIGN KEY(emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE, FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE);')

In [27]:
conn.execute('CREATE TABLE branch_supplier (branch_id INT, supplier_name VARCHAR(40), supply_type VARCHAR(40), PRIMARY KEY(branch_id, supplier_name), FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE);')

In [28]:
conn.execute('INSERT INTO employee VALUES(100, "David", "Wallace", "1967-11-17", "M", 250000, NULL, NULL);')
conn.execute('INSERT INTO branch VALUES(1, "Corporate", 100, "2006-02-09");')

In [29]:
conn.execute('UPDATE employee SET branch_id = 1 WHERE emp_id = 100;')

In [30]:
conn.execute("INSERT INTO employee VALUES(101, 'Jan', 'Levinson', '1961-05-11', 'F', 110000, 100, 1);")
conn.execute("INSERT INTO employee VALUES(102, 'Michael', 'Scott', '1964-03-15', 'M', 75000, 100, NULL);")
conn.execute("INSERT INTO branch VALUES(2, 'Scranton', 102, '1992-04-06');")

In [31]:
conn.execute("UPDATE employee SET branch_id = 2 WHERE emp_id = 102;")
conn.execute("INSERT INTO employee VALUES(103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2);")
conn.execute("INSERT INTO employee VALUES(104, 'Kelly', 'Kapoor', '1980-02-05', 'F', 55000, 102, 2);")
conn.execute("INSERT INTO employee VALUES(105, 'Stanley', 'Hudson', '1958-02-19', 'M', 69000, 102, 2);")
conn.execute("INSERT INTO employee VALUES(106, 'Josh', 'Porter', '1969-09-05', 'M', 78000, 100, NULL);")
conn.execute("INSERT INTO branch VALUES(3, 'Stamford', 106, '1998-02-13');")
conn.execute("UPDATE employee SET branch_id = 3 WHERE emp_id = 106;")


conn.execute("INSERT INTO employee VALUES(107, 'Andy', 'Bernard', '1973-07-22', 'M', 65000, 106, 3);")
conn.execute("INSERT INTO employee VALUES(108, 'Jim', 'Halpert', '1978-10-01', 'M', 71000, 106, 3);")

conn.execute("INSERT INTO branch_supplier VALUES(2, 'Hammer Mill', 'Paper');")
conn.execute("INSERT INTO branch_supplier VALUES(2, 'Uni-ball', 'Writing Utensils');")
conn.execute("INSERT INTO branch_supplier VALUES(3, 'Patriot Paper', 'Paper');")
conn.execute("INSERT INTO branch_supplier VALUES(2, 'J.T. Forms & Labels', 'Custom Forms');")

conn.execute("INSERT INTO branch_supplier VALUES(3, 'Uni-ball', 'Writing Utensils');")
conn.execute("INSERT INTO branch_supplier VALUES(3, 'Hammer Mill', 'Paper');")
conn.execute("INSERT INTO branch_supplier VALUES(3, 'Stamford Lables', 'Custom Forms');")

conn.execute("INSERT INTO client VALUES(400, 'Dunmore Highschool', 2);")
conn.execute("INSERT INTO client VALUES(401, 'Lackawana Country', 2);")
conn.execute("INSERT INTO client VALUES(402, 'FedEx', 3);")
conn.execute("INSERT INTO client VALUES(403, 'John Daly Law, LLC', 3);")
conn.execute("INSERT INTO client VALUES(404, 'Scranton Whitepages', 2);")
conn.execute("INSERT INTO client VALUES(405, 'Times Newspaper', 3);")
conn.execute("INSERT INTO client VALUES(406, 'FedEx', 2);")

conn.execute("INSERT INTO works_with VALUES(105, 400, 55000);")
conn.execute("INSERT INTO works_with VALUES(102, 401, 267000);")
conn.execute("INSERT INTO works_with VALUES(108, 402, 22500);")
conn.execute("INSERT INTO works_with VALUES(107, 403, 5000);")
conn.execute("INSERT INTO works_with VALUES(108, 403, 12000);")
conn.execute("INSERT INTO works_with VALUES(105, 404, 33000);")
conn.execute("INSERT INTO works_with VALUES(107, 405, 26000);")
conn.execute("INSERT INTO works_with VALUES(102, 406, 15000);")
conn.execute("INSERT INTO works_with VALUES(105, 406, 130000);")

In [56]:
show_table_results('Select * From employee limit 5;') # first 5 employee from table
print('============')
show_table_results('Select first_name AS forename, last_name AS Surname from employee;') # changing column name in output
print('============')
show_table_results('Select DISTINCT sex From employee')
print('============')
show_table_results('Select Count(emp_id) From employee WHERE sex = "F" AND birth_day > "1970-01-01";')
print('============')
show_table_results("Select AVG(emp_id) From employee WHERE sex = 'F' AND birth_day > '1970-01-01';")
# print('============')
show_table_results("Select SUM(emp_id) From employee WHERE sex = 'F' AND birth_day > '1970-01-01';")
# print('============')
show_table_results("Select Count(sex), sex From employee GROUP BY sex;")
# print('============')
show_table_results("Select SUM(total_sales), emp_id From works_with GROUP BY emp_id;")
# print('============')
show_table_results("Select SUM(total_sales), client_id From works_with GROUP BY client_id;")
print('============')
show_table_results("Select Count(sex), sex From employee GROUP BY sex;")

(100, 'David', 'Wallace', datetime.date(1967, 11, 17), 'M', 250000, None, 1)
(101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(102, 'Michael', 'Scott', datetime.date(1964, 3, 15), 'M', 75000, 100, 2)
(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2)
(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2)
============
('David', 'Wallace')
('Jan', 'Levinson')
('Michael', 'Scott')
('Angela', 'Martin')
('Kelly', 'Kapoor')
('Stanley', 'Hudson')
('Josh', 'Porter')
('Andy', 'Bernard')
('Jim', 'Halpert')
============
('M',)
('F',)
============
(2,)
============
(Decimal('103.5000'),)
(Decimal('207'),)
(6, 'M')
(3, 'F')
(Decimal('282000'), 102)
(Decimal('218000'), 105)
(Decimal('31000'), 107)
(Decimal('34500'), 108)
(Decimal('55000'), 400)
(Decimal('267000'), 401)
(Decimal('22500'), 402)
(Decimal('17000'), 403)
(Decimal('33000'), 404)
(Decimal('26000'), 405)
(Decimal('145000'), 406)
============
(6, 'M')
(3, 'F')

In [55]:
show_table_results("Select e.emp_id, e.first_name, e.last_name, m.first_name 'MGR_First_name', m.last_name 'MGR_Last_name' FROM employee e join employee m ON (e.super_id = m.emp_id);")

(101, 'Jan', 'Levinson', 'David', 'Wallace')
(102, 'Michael', 'Scott', 'David', 'Wallace')
(103, 'Angela', 'Martin', 'Michael', 'Scott')
(104, 'Kelly', 'Kapoor', 'Michael', 'Scott')
(105, 'Stanley', 'Hudson', 'Michael', 'Scott')
(106, 'Josh', 'Porter', 'David', 'Wallace')
(107, 'Andy', 'Bernard', 'Josh', 'Porter')
(108, 'Jim', 'Halpert', 'Josh', 'Porter')

In [54]:
show_table_results("Select * From employee;")

(100, 'David', 'Wallace', datetime.date(1967, 11, 17), 'M', 250000, None, 1)
(101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(102, 'Michael', 'Scott', datetime.date(1964, 3, 15), 'M', 75000, 100, 2)
(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2)
(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2)
(105, 'Stanley', 'Hudson', datetime.date(1958, 2, 19), 'M', 69000, 102, 2)
(106, 'Josh', 'Porter', datetime.date(1969, 9, 5), 'M', 78000, 100, 3)
(107, 'Andy', 'Bernard', datetime.date(1973, 7, 22), 'M', 65000, 106, 3)
(108, 'Jim', 'Halpert', datetime.date(1978, 10, 1), 'M', 71000, 106, 3)